SST4/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-3   0 -3)   // 0
    (7.5  0 -3)   // 1
    (7.5  3 -3)   // 2
    (-3   3 -3)   // 3
    (-3   0  3)   // 4
    (7.5  0  3)   // 5
    (7.5  3  3)   // 6
    (-3   3  3)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (36 12 16) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    symmetryPlane
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }

    // remaining side at y = 3 (keep old name "frontAndBack" if case uses it)
    frontAndBack
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
