SST4/system/blockMeshDict_uuseit66ta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-3 -4 -4)
    (15 -4 -4)
    (15  4 -4)
    (-3  4 -4)
    (-3 -4 4)  // 4
    (15 -4 4)
    (15  4 4)
    (-3  4 4)
    (-3.0 -4 -4)  // 8
    (-3.0  4 -4)
    (-3.0 -4 4)
    (-3.0  4 4)
    (-4.2 -4 -4) // 12
    (-4.2  4 -4)
    (-4.2 -4 4)
    (-4.2  4 4)
);

    edges
    (
        arc 12 13 (-7.2 0.0 -4.0)
        arc 14 15 (-7.2 0.0 4.0)
    ); 
blocks
(
    hex (0 1 2 3 4 5 6 7) (72 32 32) simpleGrading (1 1 1)
    hex (8 9 13 12 10 11 15 14) (32 12 32) simpleGrading (1 1 1)
    
);



boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (9 11 13 15)
            (8 10 12 14)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (12 13 14 15)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (8 9 12 13)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
            (10 11 14 15)
        );
    }
    inlet_original
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    end_new
    {
        type patch;
        faces
        (
            (8 9 11 10)
        );
    }
);

mergePatchPairs
(
    (inlet_original end_new)
);

// ************************************************************************* //
